Map<String, String> arabicStrings = {
  //home page
  'app_title': 'BackPal',
  'app_slogan': 'ظهرك يستحق الأفضل!',
  'app_exhort': 'لنعتني بظهرك!',
  'app_start': 'ابدأ',
  'app_stop': 'توقف',
  'app_time_alert_title': 'إعدادات الوقت غير صالحة',
  'app_time_alert_body': 'لا يمكن أن يكون وقت الانتهاء قبل وقت البدء. غير وقت الانتهاء في الإعدادات لرؤية الإشعارات.',
  'app_upgrade': 'الترقية إلى النسخة المحترفة!',
  'app_about': 'حول',
  'app_settings': 'الإعدادات',
  //about page
  'app_about_1par': 'مرحبًا بك في تطبيق \'BackPal\' - رفيقك الرقمي للعمود الفقري! غالبًا ما ننسى وضعيتنا، ولكن هذه هي فرصتك لتكون بطل الوضع. BackPal هو أكثر من مجرد تطبيق. إنها تذكرة فوزك لظهر أكثر صحة. وداعًا للإنحناء، ومرحبًا بوضعية يفتخر بها حتى جدتك. دع BackPal يكون أفضل صديق لظهرك.',
  'app_about_2par': 'هدف BackPal هو إرسال تذكيرات دورية لتقويم ظهرك. يمكنك ضبط فاصل التذكير في صفحة الإعدادات، وكذلك ساعات بداية ونهاية التذكير خلال اليوم. الفاصل الزمني الافتراضي للتذكير هو 30 دقيقة يوميًا من الساعة 9 صباحًا حتى الساعة 6 مساءً، باستثناء عطلة نهاية الأسبوع. يتم تعيين هذه الفترة لأن معظم الناس يعملون في المكتب أو يجلسون أمام حواسيبهم، غالبًا دون الانتباه إلى وضعيتهم. الأمر الأهم هو أنه في كل مرة تتلقى فيها تذكيرًا، يجب عليك اتباعه، في الأفضل بدون نسيان الحفاظ على ظهرك مستقيمًا حتى التذكير التالي.',
  //settings page
  'app_settings_language': 'اللغة',
  'app_settings_intervalReminder': 'فاصل التذكير',
  'app_settings_startTime': 'وقت البدء اليومي',
  'app_settings_endTime': 'وقت الانتهاء اليومي',
  'app_settings_endTime_alert_title': 'وقت الانتهاء غير صالح',
  'app_settings_endTime_alert_body': 'لا يمكن أن يكون وقت الانتهاء قبل وقت البدء',
  'app_settings_inclWeekends': 'تضمين عطلات نهاية الأسبوع',
  'app_settingsPro_title': 'إعدادات النسخة المحترفة',
  'app_settingsPro_showAds': 'عرض الإعلانات',
  'app_settingsPro_country': 'اختر البلد',
  'app_settingsPro_holidays': 'إيقاف في العطلات',
  //Pro features page
  'app_pro_title': 'استكشاف ميزات النسخة المحترفة',
  'app_pro_header': 'مزايا النسخة المحترفة',
  'app_pro_adv1': 'تعطيل الإعلانات',
  'app_pro_adv2': 'تكوين الإعدادات الخاصة بك',
  'app_pro_adv3': 'يمكنك اختيار بلدك',
  'app_pro_adv4': 'يمكنك تعطيل التنبيهات في الأيام الوطنية والعطلات',
  'app_pro_adv5': 'الحصول على تحسينات إضافية بعد تحديثات BackPal',
  'app_pro_oneMonth': 'اشتراك لمدة شهر واحد',
  'app_pro_only': 'فقط',
  'app_pro_oneYear': 'اشتراك لمدة عام واحد',

  // Notification titles
  'notification_titles': 'قم بتقويم ظهرك!;ظهرك مستقيم!;BackPal، استقم!',

// Notification messages
  'notification_messages': '''
قم بتقويم ظهرك كسهم!;راجع وضعك: ابقَ مستقيمًا، يا صديقي!;شجع على فقرات ظهرك.;حان وقت الانتباه إلى الوضع!;انتهى زمن وضع الظهر المنحني، اعتمد وضعًا صحيحًا!;ظهر مستقيم، تبدو رائعًا!;انتصف وقفاً كأنك ستبهر الملكة.;عد إلى الأعمال الجادة - حرفيًا!;اجعل فقرات ظهرك فخورة.;كن الرئيس التنفيذي لفقرتك الخاصة.;ظهرك اتصل، إنه يريد ترقية.;كن بيكاسو الوضع الجيد - ابتكر روائعك!;لا مكان لوضع الظهر المستسلم في هذا المجال.;توقف عن الانحناء، احتضن الوقوف المستقيم!;الظهر في العمل - في طريقه للتحكم!;حان وقت الخطوات العمودية.;قم بتسوية السفينة، كابتن الوضع!;قوم بالوقوف كبرج إيفل للوضع!;عد إلى الانتباه للوضع: تتمة لسجلات الميل.;الوضع كما لو أن شخصًا ما يراقبك... لأنهم كذلك.;شرطة الوضع في الخدمة - كن مستقيمًا أو اتحمل العواقب!;حرية من السجن الذي يسمى وضع الظهر المستسلم؛ ظهرك يستحق الأفضل!;حان الوقت لتحرير نفسك من فخ وضع الظهر المستسلم؛ ظهرك يستحق ذلك!;مستوى الوضع: أسطوري.;ظهرك يستحق تصفيقًا واقفًا - حرفيًا!;قف مستقيمًا، سيشكرك ذاتك المستقبلية.;انفصل عن وضع الظهر المستسلم؛ ليس ذلك بسببك، إنه بسبب فقراتك.;شرطة الوضع في العمل - كن مستقيمًا أو اتحمل العواقب!;حرر قوة العمود الفقري القوية.;الوضع كما لو أنك على وشك فوز تذكرة لليانصيب!;احتفظ بالوقوف المستقيم؛ إنها لغة الفائزين.;قل لا لانحناء الظهر؛ نعم للوضع.;شرطة الوضع في الخدمة - كن مستقيمًا أو اتحمل العواقب!;حرر قوة الوق
''',
};