Map<String, String> ukrainianStrings = {
//home page
'app_title': 'BackPal',
'app_slogan': 'Твоя спина заслуговує найкращого!',
'app_exhort': 'Давайте подбаємо про вашу спину!',
'app_start': 'Старт',
'app_stop': 'Стоп',
'app_time_alert_title': 'Неправильні часові налаштування',
'app_time_alert_body': 'Час завершення не може бути раніше часу початку. Змініть час завершення в налаштуваннях, щоб бачити сповіщення.',
'app_upgrade': 'Оновити до Pro!',
'app_about': 'Про додаток',
'app_settings': 'Налаштування',
//about page
'app_about_1par': 'Ласкаво просимо до додатка \'BackPal\' – вашого цифрового друга для спини! Ми доволі часто ігноруємо свою поставу, але цей додаток - ваш шанс стати чемпіоном постави. BackPal - це не просто додаток, це ваш квиток до здоровішої спини. Прощайте зігнуті спини, вітаємо з поставою, якою пишалася б ваша бабуся. Нехай BackPal буде найкращим другом вашої спини.',
'app_about_2par': 'Мета BackPal - регулярно надсилатиме вам нагадування щоб вирівнювати спину. Ви можете налаштувати інтервал нагадувань на сторінці налаштувань, а також початковий і кінцевий час нагадувань протягом дня. За замовчуванням інтервал нагадувань - 30 хвилин кожного дня з 9 ранку до 6 вечора, окрім вихідних. Цей період встановлений тому, що більшість людей працює в офісі або сидить перед комп\'ютером, часто не приділяючи уваги своїй поставі. Найголовніше - кожного разу, коли ви отримуєте нагадування, ви повинні йому слідувати, ідеально - не забуваючи тримати спину рівною до наступного нагадування.',
//settings page
'app_settings_language': 'Мова',
'app_settings_intervalReminder': 'Інтервал нагадування',
'app_settings_startTime': 'Початковий час',
'app_settings_endTime': 'Кінцевий час',
'app_settings_endTime_alert_title': 'Неправильний час завершення',
'app_settings_endTime_alert_body': 'Час завершення не може бути раніше часу початку',
'app_settings_inclWeekends': 'Включити вихідні',
'app_settingsPro_title': 'Налаштування Pro',
'app_settingsPro_showAds': 'Показувати рекламу',
'app_settingsPro_country': 'Вибрати країну',
'app_settingsPro_holidays': 'Вимкнути в святкові дні',
//Pro features page
'app_pro_title': 'Дослідіть функції Pro',
'app_pro_header': 'Переваги версії Pro',
'app_pro_adv1': 'Ви можете вимкнути рекламу',
'app_pro_adv2': 'Налаштувати власні параметри',
'app_pro_adv3': 'Ви можете вибрати свою країну',
'app_pro_adv4': 'Ви можете вимкнути сповіщення в святкові дні',
'app_pro_adv5': 'Отримуйте подальше вдосконалення додатка після оновлень BackPal',
'app_pro_oneMonth': 'Підписка на один місяць',
'app_pro_only': 'тільки',
'app_pro_oneYear': 'Підписка на один рік',
'app_pro_buy': 'Купити',
'app_pro_temporaryNotification': 'Покупка Pro версії тимчасово недоступна.',

  // Notification titles
  'notification_titles': 'Випрями спину!;Пряма спина!;Спину прямо!',

  // Notification messages
  'notification_messages': '''
Випрямися, наче стріла!;
Перевір свою осанку: стій прямо, мій друг!;
Підійми свій хребет на бесіду!;
Час для моменту повернення уваги до осанки!;
Попрощайся зі слабкою осанкою, приймай поставу!;
Спину вгору, і виглядатимеш божественно!;
Прямись, наче ти готуєшся вражати королеву.;
Знову в бізнесі — випрямся буквально!;
Зроби свої хребці гордими!;
Встанови осанку будто на тебе дивиться світ.;
Твоя спина викликає, вона хоче підняття.;
Будь головою власного хребта.;
Використовуйте силу прекрасної осанки.;
Наче космонавт — шия вгорі, спина пряма!;
Зупиніть зауваження спини, приймайте стрункі рішення!;
Спина прямо, намірено: активовано!;
Підніми свою осанку!;
Спина, а не стан, хоче просування.;
Осанка на рівні космічного польоту — створіть шедевр!;
Немає слабкості — є твоя здорова спина.;
Час взяти себе в руки — твоя спина це заслуговує!;
Твоя спина — VIP (дуже важлива осанка)!;
Стій прямо, подякує тобі твій майбутній я.;
Закінчи зі слабкою осанкою, вітаючи ростовий період.;
Осанка як у 007 — створіть враження!;
Іди на зустріч легендарним осанкам.;
Прокинься, зроби свою осанку великою!;
Спина прямо, ідентичність — теж.;
Скажіть "ні" свалюванню — тільки пряма осанка.;
Поліція осанки на звітній — стій прямо або стикнешся з наслідками.;
Утримуйте свою хребет як джедай — сила в тобі!;
Вертикальні вібрації тільки; горизонтальне — минулого сезону.;
Звільніть себе від полону слабкої осанки, твоя спина заслуговує на краще!;
Час скасувати слабку осанку; це не ти, це твій хребет.;
Осанка як вежа, вище за всі.;
Спина прямо, рівень впевненості — через дах!;
Скажіть "так" хорошій осанці; скажіть "ні" гірчичнику після обіду.;
Поліція осанки: дотримуйтеся чи терпіть наслідки.;
Зупини слабкість, приголомш світ.;
Стань, наче ти таємничий екзекутор правильної осанки.;
Ні слабкості в цьому шматку, тільки віртуозна осанка!;
Дорога до успіху виведена чіткою осанкою.;
Осанка — секретна зброя твого успіху.;
Стань високо, і світ адаптується.;
Твоя спина — головна подія, буквально!;
Спина прямо, піднеси голову, завойовуй день.;
Спрямуйся і впливай на свою осанку!;
Знову до висоти: прямо вгору!;
Перевір осанку: прямо, не втікай від неї.;
Підійми свою осанку як тишу, високо і безшумно!;
Час для осанкового витриму!;
Осанка, основа твого здоров'я!;
Спину вгору, оновлення в процесі.;
Осанка, таємний герой здоров'я!;
Випрямляйся, осанка — твій новий стиль.;
Поліція осанки: чинності чи відповідальність.;
Запиши свою осанку як маніфест успіху.;
Піднімай свою осанку, нічого не стримуючи.;
Осанка — секрет твоєї внутрішньої сили.;
Спина прямо, дорога до успіху теж.;
Осанка — твій стан величі.;
Стій прямо, наче тебе дивиться твоє майбутнє "я".;
Осанка — твоє особисте головне бюро.;
Спрямуйся, підвищуй рівень — твої правила, твоя спина.;
Переоціни свою осанку, світ тобою захопиться!'''
};