//Japanese
Map<String, String> japaneseStrings = {
  //home page
  'app_title': 'BackPal',
  'app_slogan': 'あなたの背中には最高のケアが必要です！',
  'app_exhort': 'あなたの背中を大切にしましょう！',
  'app_start': '開始',
  'app_stop': '停止',
  'app_time_alert_title': '無効な時間設定',
  'app_time_alert_body': '終了時間は開始時間よりも前に設定できません。通知を見るには設定で終了時間を変更してください。',
  'app_upgrade': 'Proにアップグレード！',
  'app_about': 'について',
  'app_settings': '設定',
  //about page
  'app_about_1par': '\'BackPal\'アプリへようこそ - あなたのデジタル背骨の相棒！私たちは姿勢を隠し続けてきましたが、ここでは姿勢のチャンピオンになるチャンスがあります。BackPalはただのアプリ以上のものです。それはより健康な背中への裏口券です。背中を丸めるのをやめ、あいさつをする背中にこんにちは。BackPalをあなたの背中の親友にしましょう。',
  'app_about_2par': 'BackPalの目標は、定期的に背中を伸ばすようにリマインダーを送信することです。通知のインターバルや一日の通知の開始および終了時間を設定ページで調整できます。通知のデフォルトのインターバルは、毎日午前9時から午後6時までの30分ですが、週末を除きます。この期間は、多くの人がオフィスで働いたり、コンピュータの前で座っていることが一般的で、しばしば姿勢に注意を払わないためです。最も重要なのは、通知を受け取るたびに、理想的には次の通知まで背中をまっすぐに保つことを忘れないでください。',
  //settings page
  'app_settings_language': '言語',
  'app_settings_intervalReminder': 'インターバルリマインダー',
  'app_settings_startTime': '毎日の開始時間',
  'app_settings_endTime': '毎日の終了時間',
  'app_settings_endTime_alert_title': '無効な終了時間',
  'app_settings_endTime_alert_body': '終了時間は開始時間よりも前には設定できません',
  'app_settings_inclWeekends': '週末を含む',
  'app_settingsPro_title': 'プロの設定',
  'app_settingsPro_showAds': '広告を表示',
  'app_settingsPro_country': '国を選択',
  'app_settingsPro_holidays': '休日にオフにする',
  //Pro features page
  'app_pro_title': 'プロ機能を探索',
  'app_pro_header': 'プロバージョンの利点',
  'app_pro_adv1': '広告を無効にする',
  'app_pro_adv2': '独自の設定を構成する',
  'app_pro_adv3': '国を選択できます',
  'app_pro_adv4': '休日に通知を無効にできます',
  'app_pro_adv5': 'BackPalのアップデート後にさらなるアプリの改善を取得します',
  'app_pro_oneMonth': '1か月のサブスクリプション',
  'app_pro_only': 'のみ',
  'app_pro_oneYear': '1年のサブスクリプション',

  // Notification titles
  'notification_titles': '背筋を伸ばして！;背筋をまっすぐに！;BackPal、まっすぐに立って！',

// Notification messages
  'notification_messages': '''
矢のように背筋を伸ばせ！;ポストチェック：まっすぐに立って、友よ！;脊柱を励ませ。;ポストアラートの時間だ！;くの字型のポストはもう終わり、まっすぐなポストを採用しろ！;背筋を伸ばせば、見事なものになる！;クイーンに感動を与えるつもりでまっすぐ立て。;ビジネスモード再開、文字通り！;脊柱を誇りに思わせろ。;自分の脊柱のCEOになれ。;君の背中が呼んでいる、昇進を望んでいる。;良いポストのピカソになり、傑作を創造しろ！;この領域では猫背のポストは通用しない。;傾けを止めて、まっすぐなポストを抱擁しろ！;背中を使って、征服への道を歩め！;縦型のポストの時間だ。;船を整列させろ、ポストの船長よ。;エッフェル塔のようなポストを持てば。;ポストに気を配る時間：傾いた記録の続編だ。;誰かが見ているかのようにポストを続けろ... 実際に見ているのだから。;ポストパトロール出動中：まっすぐにいないと、結果を受け入れろ！;くの字型ポストの拘束から解放されろ；君の背中はもっと良いものに値する！;くの字型ポストの罠から解放されるべき時だ；君の背中はそれに値する！;ポストのレベル：伝説。;君の背中はスタンディングオベーションを受ける価値がある、文字通り！;立てば未来の君に感謝される。;くの字型ポストから解放されろ；君の脊柱が悩んでいるのは君のせいではない。;ポストパトロール出動中：まっすぐにいないと、結果を受け入れろ！;強力な脊柱の力を解き放て。;ポストを持っているかのように、宝くじに当たるかもしれない！;直立していれば、それが勝者の言葉だ。;くの字型を言いなりにせず、まっすぐなポストに賛成だ。;ポストパトロール出動中：まっすぐにいないと、結果を受け入れろ！;立てばその力を解き放て。;くの字型ポストの拘束から解放されろ；君の背中はもっと良いものに値する！;くの字型ポストの罠から解放されるべき時だ；君の背中はそれに値する！;ポストのレベル：エキスパート解禁。;立てば、自信は天井を突き抜ける。;この森の中では傾くことは許されない。;
ポストをチェック：感嘆符である''',
};