//Korean
Map<String, String> koreanStrings = {
  //home page
  'app_title': 'BackPal',
  'app_slogan': '당신의 등은 최고의 관리를 받아야 합니다!',
  'app_exhort': '당신의 등을 돌보자!',
  'app_start': '시작',
  'app_stop': '정지',
  'app_time_alert_title': '시간 설정 무효',
  'app_time_alert_body': '종료 시간은 시작 시간보다 빠를 수 없습니다. 알림을 보려면 설정에서 종료 시간을 변경하세요.',
  'app_upgrade': 'Pro로 업그레이드!',
  'app_about': '소개',
  'app_settings': '설정',
  //about page
  'app_about_1par': '\'BackPal\' 앱에 오신 것을 환영합니다 - 디지털 등뼈 친구! 우리는 자세를 간과하기 쉽지만, 여기에서 자세 챔피언이 되어 보세요. BackPal은 단순한 앱 이상의 것입니다. 이건 더 건강한 등에 대한 당신의 VIP 초청장입니다. 구부러진 자세에 작별을 고하고, 인사를 할 수 있는 자세로 안녕하세요. BackPal을 당신의 등의 가장 친한 친구로 삼아보세요.',
  'app_about_2par': 'BackPal의 목표는 규칙적인 알림을 통해 등을 곧게 펼치라는 것입니다. 설정 페이지에서 알림 간격 및 하루 중 알림 시작 및 종료 시간을 조절할 수 있습니다. 알림의 기본 간격은 주말을 제외하고 매일 오전 9시부터 오후 6시까지 30분입니다. 이 기간은 대부분의 사람들이 사무실에서 일하거나 컴퓨터 앞에 앉아있는 경우가 많기 때문에 설정되었습니다. 알림을 받을 때마다 중요한 것은 이를 따르는 것이며, 이상적으로는 다음 알림까지 등을 곧게 유지하는 것을 잊지 않는 것입니다.',
  //settings page
  'app_settings_language': '언어',
  'app_settings_intervalReminder': '간격 알림',
  'app_settings_startTime': '매일 시작 시간',
  'app_settings_endTime': '매일 종료 시간',
  'app_settings_endTime_alert_title': '종료 시간 무효',
  'app_settings_endTime_alert_body': '종료 시간은 시작 시간보다 빠를 수 없습니다',
  'app_settings_inclWeekends': '주말 포함',
  'app_settingsPro_title': 'Pro 설정',
  'app_settingsPro_showAds': '광고 표시',
  'app_settingsPro_country': '국가 선택',
  'app_settingsPro_holidays': '휴일에 끄기',
  //Pro features page
  'app_pro_title': 'Pro 기능 살펴보기',
  'app_pro_header': 'Pro 버전의 이점',
  'app_pro_adv1': '광고 비활성화',
  'app_pro_adv2': '자체 설정 구성',
  'app_pro_adv3': '국가 선택 가능',
  'app_pro_adv4': '휴일에 알림 비활성화 가능',
  'app_pro_adv5': 'BackPal 업데이트 후 추가 앱 개선 사항 받기',
  'app_pro_oneMonth': '1개월 구독',
  'app_pro_only': '만',
  'app_pro_oneYear': '1년 구독',

  // Notification titles
  'notification_titles': '활강척을 펴세요!;등을 곧게!;BackPal, 곧게 서 있어요!',

// Notification messages
  'notification_messages': '''
활강척을 펴봐요!;자세 체크: 똑바로 서라, 친구야!;척추를 격려하세요.;자세 경고 시간이에요!;끝난 그릇 자세, 똑바로 자세로 채택하세요!;등을 똑바로 펴면 멋진 것이 됩니다!;여왕에게 감동을 주려면 똑바로 서세요.;비즈니스 모드로 다시 돌아갑니다, 문자 그대로!;척추를 자랑스럽게 여기세요.;자신의 척추 CEO가 되어 보세요.;당신의 등이 부르고 있어요, 승진을 원해요.;좋은 자세의 피카소가 되어 작품을 창조하세요!;이 영역에서는 굽은 자세가 통하지 않아요.;구부러진 자세를 그만두고 똑바로 자세로 포옹하세요!;등을 이용하여 정복으로 향하는 길을 걸어보세요!;세로 자세의 시간이에요.;배를 정렬하세요, 자세의 선장이여!;에펠탑처럼 똑바로 서는 자세를 가지세요!;자세에 주의를 기울이는 시간: 기울인 기록의 연속입니다.;누군가가 당신을 지켜보는 것처럼 자세를 유지하세요... 사실 그렇게 하는 중이에요.;자세 경찰이 근무 중: 똑바로 서지 않으면 결과를 감내하세요!;굽은 자세의 감옥에서 해방하세요; 당신의 등은 더 나은 것을 받을 자격이 있어요!;굽은 자세의 함정에서 벗어나는 시간입니다; 당신의 등은 그것에 가치가 있어요!;자세 레벨: 전설적입니다.;당신의 등은 기립 박수를 받을 만큼 가치가 있어요, 문자 그대로!;일어서면 미래의 당신이 감사할 거에요.;굽은 자세에서 해방하세요; 당신의 문제가 아니에요, 당신의 척추의 문제에요.;자세 경찰이 근무 중: 똑바로 서지 않으면 결과를 감내하세요!;강력한 척추의 힘을 해방하세요.;자세를 가지고 있는 것처럼, 로또에서 당첨될 지도 몰라요!;똑바로 서 있으면 그것이 승자의 언어입니다.;굽은 자세에 NO를 말하고, 자세에 YES를 말하세요.;자세 경찰이 근무 중: 똑바로 서지 않으면 결과를 감내하세요!;똑바로 서 있으면 그 힘을 해방하세요.;굽은 자세의 감옥에서 해방하세요; 당신의 등은 더 나은 것을 받을 자격이 있어요!;굽은 자세의 함정에서 벗어나는 시간입니다; 당신의 등은 그것에 가치가 있어요!;자세 레벨: 전문가 언락.;일어서면 자신감이 하늘 높이 솟아오를 거에요.;
이 숲에서는 구부러지는 것은 허용''',
};